"""
Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).
"""
n = ""
for i in range(1,8):
    print(str(n) + "*")
    n += "*"