'''
Напишите программу, которая приветствует пользователя,
выводя слово «Привет» (без кавычек), после которого должна стоять запятая и пробел,
а затем введенное имя и восклицательный знак.
Формат входных данных
На вход программе подаётся одна строка — имя пользователя.
Формат выходных данных
Программа должна вывести текст в соотвествии с условием задачи.
'''
name = input()
print('Привет,', name, end='!')